Revit 2026 API

# PDFExportOptionsCombine Property

---

Whether export all views and sheets into one PDF file or multiple files.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool Combine { get; set; }
```
```vb
Public Property Combine As Boolean
	Get
	Set
```
```cpp
public:
property bool Combine {
	bool get ();
	void set (bool value);
}
```
```fsharp
member Combine : bool with get, set
```

#### Property Value

Boolean

If , all exported views and sheets will be exported into one PDF file, whose file name would be specified by FileName. If , each exported view and sheet will have its own PDF file created, whose file name would be generated with [!:NamingRule].

#### Reference

PDFExportOptions Class

Autodesk.Revit.DB Namespace